// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_МатематическиеКлиентСервер. Версия 1.1 от 03.11.2018
// Назначение: Содержит математические функции.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.


// Возвращает число 0,1,-1 в зависимости от знака числа ч
//
//ПАРАМЕТРЫ
//	_ч:Число. Число, знак которого нужно определить.
//ВОЗВРАЩАЕТ
//	Число.
Функция ЗнакЧисла(_ч) Экспорт
	Если _ч = 0 Тогда
		Возврат 0; 
	ИначеЕсли _ч > 0 Тогда 
		Возврат 1; 
	Иначе
		Возврат -1; 
	КонецЕсли; 
КонецФункции

// Возвращает абсолютное значение числа
Функция Абс(_ч) Экспорт
	Возврат Макс(_ч,-_ч); 
КонецФункции


Функция ОкрВверх(знач _ч, знач Разрядность = 0) Экспорт
	Множитель = 1;
	Для сч=1 По Абс(Разрядность) Цикл
		Множитель = Множитель * 10;
	КонецЦикла; 
	Если Разрядность < 0 Тогда
		Множитель = 1/Множитель;
	КонецЕсли; 
	
	Если Множитель <> 1 Тогда
		_ч = _ч*Множитель;
	КонецЕсли; 
	Если _ч <> Цел(_ч) Тогда
		_ч = Цел(_ч + 1);
	КонецЕсли;
	
	Если Множитель <> 1 Тогда
		_ч = _ч/Множитель;
	КонецЕсли; 
	
	Возврат _ч;
КонецФункции
