// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_ДесериализацияКлиентСервер. Версия 1.0 от 20.04.2021
// Назначение: Содержит функции десериализации строковых данных из различных форматов. Работает на клиенте и сервере.
// Зависимости: Отсутствуют.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

#Область Общее

Функция ПеречислениеПоИмени(знач Имя, знач ЗначениеСтр) Экспорт
	Если ПустаяСтрока(ЗначениеСтр) Тогда
		ЗначениеСтр = "ПустаяСтрока";
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение(СтрШаблон("Перечисление.%1.%2", Имя, ЗначениеСтр)); 
КонецФункции

#КонецОбласти 