// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_ИнтеграцияСБСППереопределяемый. Версия 1.0 от 24.10.2018
// Назначение: Содержит функции, которые обращаются непосредственно к БСП.
// Если БСП отсутствует, потребуется их реализовать.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

#Область ОбщегоНазначения

Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Коэффициенты, Знач Точность = 2) Экспорт
	Возврат ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, Коэффициенты, Точность);

КонецФункции

#КонецОбласти 
