// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_ДесериализацияКлиентСервер. Версия 1.1 от 23.04.2021
// Назначение: Содержит функции десериализации строковых данных из различных форматов. Работает на клиенте и сервере.
// Зависимости: Отсутствуют.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

#Область Общее

Функция ПеречислениеПоИмени(ИмяТипаПеречисления, Значение) Экспорт
	Если ТипЗнч(Значение) <> Тип("ПеречислениеСсылка."+ИмяТипаПеречисления) или Значение.Пустая() Тогда
		Возврат ""; 
	КонецЕсли;
	Возврат СтрРазделить(ПолучитьПолноеИмяПредопределенногоЗначения(Значение),".")[2];
КонецФункции

#КонецОбласти 