// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_РаботаСГипертекстовойРазметкойКлиентСервер. Версия 1.0 от 06.10.2024
// Назначение: Содержит методы для работы с гипертекстовой разметкой
// Зависимости: нет.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware (при указании автора разработки).

#Область ПрограммныйИнтерфейс

Функция ЭкранироватьТекстДляHTML(знач ТекстДляПреобразования) Экспорт
	Д = Новый ДокументHTML;
	Узел = Д.СоздатьТекстовыйУзел(ТекстДляПреобразования);
	Д.ЭлементДокумента.ДобавитьДочерний(Узел);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.КонфигурацияDOM.УстановитьПараметр("discard-default-content", Истина);
	ЗаписьDOM.КонфигурацияDOM.УстановитьПараметр("xml-declaration", Ложь);
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(Д, ЗаписьHTML);
    Результат = ЗаписьHTML.Закрыть();
	поз = СтрНайти(Результат,"<html>");
	Если поз <> 0 Тогда
		Результат = Сред(Результат,поз+6);
	КонецЕсли;
	поз = СтрНайти(Результат,"</html>");
	Если поз <> 0 Тогда
		Результат = Лев(Результат,поз-1);
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти
