// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_РаботаСМетаданными. Версия 1.0 от 24.07.2019
// Назначение: Содержит функции для работы с метаданными конфигурации.
// Зависимости: нет
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

Функция ПолучитьИмяПоСсылкеНаПеречисление(СсылкаНаПеречисление) Экспорт
	мдСсылки = СсылкаНаПеречисление.Метаданные();
	Результат = мдСсылки.ЗначенияПеречисления.Получить(Перечисления[мдСсылки.Имя].Индекс(СсылкаНаПеречисление)).Имя;
	Возврат Результат; 
КонецФункции
 
// Функция позволяет получить метаданные общего модуля по объекту модуля
//
// Параметры:
//  ОМ	 - ОбщийМодуль - объект общего модуля
// 
// Возвращаемое значение:
//  Метаданные, Неопределено - метаданные общего модуля, объект которого передан в параметре ОМ. 
//		В случае, если общий модуль не найден, возвращается Неопределено.
//
Функция МетаданныеОбщегоМодуля(ОМ) Экспорт
    Для Каждого ОбъектМетаданных Из Метаданные.ОбщиеМодули Цикл
        Если Вычислить(ОбъектМетаданных.Имя) = ОМ Тогда
            Возврат ОбъектМетаданных;
        КонецЕсли;
    КонецЦикла;
	Возврат Неопределено; 
КонецФункции