// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_ФайловыеКлиентСервер. Версия 1.2 от 18.07.2019
// Назначение: Содержит функции для работы с файлами и потоками.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

Функция КаталогСуществует(ИмяКаталога) Экспорт 
	Ф=Новый Файл(ИмяКаталога);
	Возврат Ф.Существует() и Ф.ЭтоКаталог(); 
КонецФункции

Функция ФайлСуществует(ИмяФайла) Экспорт
	Ф=Новый Файл(ИмяФайла);
	Возврат Ф.Существует() и Ф.ЭтоФайл(); 
КонецФункции

Функция НормализоватьКаталог(знач ИмяКаталога) Экспорт
	ИмяКаталога = СокрЛП(ИмяКаталога);
	Если СтрНачинаетсяС(ИмяКаталога, """") и СтрЗаканчиваетсяНа(ИмяКаталога, """") или СтрНачинаетсяС(ИмяКаталога, "'") и СтрЗаканчиваетсяНа(ИмяКаталога, "'") Тогда
		ИмяКаталога = Сред(ИмяКаталога, 2, СтрДлина(ИмяКаталога)-2);
	КонецЕсли; 
	Если СтрЗаканчиваетсяНа(ИмяКаталога, "\") Тогда
		Возврат ИмяКаталога; 
	Иначе
		Возврат ИмяКаталога+"\";
	КонецЕсли; 
КонецФункции // НормализоватьКаталог()

Функция НормализоватьФайл(знач ИмяФайла) Экспорт
	ИмяФайла = СокрЛП(ИмяФайла);
	Если СтрНачинаетсяС(ИмяФайла, """") и СтрЗаканчиваетсяНа(ИмяФайла, """") или СтрНачинаетсяС(ИмяФайла, "'") и СтрЗаканчиваетсяНа(ИмяФайла, "'") Тогда
		ИмяФайла = Сред(ИмяФайла, 2, СтрДлина(ИмяФайла)-2);
	КонецЕсли; 
	Возврат ИмяФайла; 
КонецФункции // НормализоватьКаталог()
