// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_СервисыИнтернетКлиент. Версия 1.0 от 22.04.2021
// Назначение: Содержит функции для работы с сетевыми сервисами и протоколами
// Зависимости: Отсутствуют.
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

Функция СформироватьHTTPОтветОшибку(знач ТекстООшибки, знач КодОшибки = 400, ContentType = "text/plain") Экспорт
	Ответ = Новый HTTPСервисОтвет(КодОшибки);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Ответ.УстановитьТелоИзСтроки(ТекстООшибки);
	Возврат Ответ; 
КонецФункции
