// Библиотека "быстрой" разработки на платформе 1С:Предприятие 8
// Модуль ББР_СовместимостьСоСтарымиПлатформами. Версия 1.0 от 28.06.2019
// Назначение: Содержит функции для обеспечения совместимости со старыми версиями платформы.
// Зависимости: нет
// Автор: Чернуль Александр Владимирович. E-mail: bzero@yandex.ru
// Лицензия на использование: Freeware.

// Внимание: После обновления платформы появивщиеся одноименные функции необходимо удалить,либо закомментировать.
// #Область Совместимость_с_8_3_6 означает также, что ф-ия появилась начиная с 8.3.6

#Область Совместимость_с_8_3
#Область Совместимость_с_8_3_6
 
//Функция СтрЗаканчиваетсяНа(стр, стрПоиска) Экспорт
//	поз = Найти(стр,стрПоиска);
//	Если поз = 0 Тогда
//		Возврат Ложь; 
//	Иначе
//		Возврат поз+СтрДлина(стрПоиска)-1 = СтрДлина(стр);
//	КонецЕсли; 
//КонецФункции

//Функция СтрНачинаетсяНа(стр, стрПоиска) Экспорт
//	поз = Найти(стр,стрПоиска);
//	Возврат поз = 1; 
//КонецФункции

#КонецОбласти	
#КонецОбласти 
